<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%-- 요청에 대한 실행결과를 CSV 형식의 데이타로 응답하는 JSP 문서 --%>
<%-- => 웹프로그램이 아닌 다른 형태의 프로그램에서도 사용할 수 있도록 값을 전달하여 응답 - Restful --%>
<%-- => 뉴스 제목과 언론사를 [,] 기호 대신 [|] 기호로 구분되도록 설정 --%>
<%-- => 뉴스와 뉴스는 엔터(Enter) 대신 [*] 기호로 구분되도록 설정 --%>    
박명수 "父 돈 없던 시절 용돈 60만 원 주셔, 지금 천배로 효도 중"|뉴스엔*
'브랜딩인성수동' 김지은, 1인2역 도전 "영혼 체인지 매력적이라 출연"|뉴스1*
"한국 치킨 먹고 싶어"…'아가일' 매튜 본 감독, '킹스맨' 시리즈 이어 韓 공략|OSEN*
이희준 "배우-제작진 전화번호 '살인자'라 저장했다" 폭소|뉴스엔*
살인자인가 단죄자인가… 제목처럼 아리송한 '살인자O난감'|일간스포츠