package oop;

//클래스(Class) : 객체(Object)를 생성하기 위한 자료형 - 참조형
// => Java 프로그램에서는 객체(Object) 대신 인스턴스(Instance)로 표현
// => 현실에 존재하는 대상을 클래스 자료형으로 표현하여 프로그램에서 사용되는 객체 생성

//클래스 자료형 선언 방법 
//형식) [public] class 클래스명 {
//             필드(Field) : 표현 대상의 속성(값)을 저장하기 위한 변수 - 멤버변수
//             생성자(Constructor) : 객체를 생성하기 위한 특별한 메소드
//             메소드(Method) : 표현 대상의 행위(기능)을 제공하기 위한 함수 - 멤버함수
//      }
// => 클래스명은 식별자로 파스칼 표기법을 사용하여 작성

//클래스 자료형을 사용하여 객체를 생성하는 방법
//형식) 클래스명 참조변수=new 클래스명();
// => new 연산자로 클래스 내부에 선언된 생성자(Constructor)를 호출하여 객체 생성
// => 힙영역에 생성된 객체의 메모리 주소를 참조변수에 저장하여 참조변수로 객체 참조
// => 참조변수에 저장된 메모리 주소로 객체를 참조하여 . 연산자를 사용하여 객체의 필드 또는 메소드 사용


//자동차를 모델링하여 작성된 클래스
public class Car {

}
