//클래스가 선언된 패키지를 표현하기 위한 문장
package basic;

//이클립스 단축키
//[Ctrl]+[Space] >> 문장 자동완성 기능
//[Ctrl]+[S] >> 저장(자동 컴파일)
//[Ctrl]+[F11] >> 실행

//주석문 : 프로그램에 설명을 제공하기 위한 문장
// => 프로그램 실행과 아무런 관계없는 문장
// => 행주석(//설명문)과 범위주석(/* 설명문 */)

/*
범위주석 : 범위 내부에 표현된 문장을 설명문으로 설정하여 사용 
*/

//깃허브(GitHub) : 분산 버전 관리 툴인 깃 저장소 호스팅 기능을 제공하는 웹서비스
//깃(Git) : 여러명의 사용자들간의 파일의 작업을 조율하기 위한 분산 버전 관리 시스템(프로그램)
public class FirstEclipseApp {
	//행주석 : 하나의 행에 표현된 문장을 설명문으로 설정하여 사용 
	public static void main(String[] args) {
		System.out.print("이클립스에서 처음 만든 프로그램입니다.");//출력메소드 호출
		System.out.println("재미있게 만들어 봐요.");/* 출력메소드 호출 */
	}
}










